{
  "title": "Socialism",
  "fullurl": "https://rationalwiki.org/wiki/Socialism",
  "mainImage": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Madrid_may_day375.jpg",
  "info": {},
  "content": [],
  "rawInfo": "[[File:Madrid may day375.jpg|thumb|right|165px|May Day in Madrid, 2006.]]\n{{economics}}{{bronze}}\n'''Socialism''' refers to a set of related [[Sociology|socio]]-[[Economics|economic]] systems based on social ownership of the means of production (as opposed to individuals personally owning them) and political management of the economy (where every individual theoretically has a small degree of influence on how large amounts of resources are used) and [[ideology|ideologies]] that seek to promote [[equality]] of opportunity while maximizing opportunities for \"self-actualization\". The exact forms of socialism differ, with some forms advocating for voluntary cooperative enterprises within a market economy while other forms advocate for a more comprehensive transformation with economic planning replacing capital markets and all means of production being held in common. It is typically opposed to [[plutocracy]] yet often emphasizes in some form or another that people who work and produce the value in society should be rewarded in monetary terms in accordance to their work effort. In the developed world during the Industrial Revolution, workers often felt underpaid for their labour, and dangerous working conditions were commonplace. While this has diminished in the developed world as it has become wealthier, multinational [[corporation]]s have succeeded in [[Globalization|expanding to less-developed countries]] where there are either fewer or no working rights laws or [[minimum wage]] laws, allowing them to pay lower wages to workers in more primitive factories to potentially increase profits. Socialism has thus always found allies in the labour movement, including [[trade union]]s, but often as part of a \"minimal program\" within capitalism, distinct from its ultimate goal of replacing capitalism with a socialist system.\n\nThe question of whether the standard Marxist-inspired definition of socialism involving social ownership of the means of production and economic planning is economically feasible has been ongoing, with social democrats having abandoned this pursuit. Historically, most attempts to establish comprehensive planned economies have either collapsed for [[Soviet Union|being politically unsustainable]] or resulted in [[North Korea|horrifying dictatorships]]. Classical Marxists maintain that socialist planning can only become attainable once technology has advanced to a point where non-market planning becomes technically feasible and that the historical attempts to introduce socialist planning by Marxist-Leninist states in the 20th century were insufficiently developed for socialism to be feasible. In the 21st century, however, a few countries in [[South America]] have taken up the mantle again, partly because nationalization of foreign-owned infrastructure and natural resources began to be perceived as a more expedient way of bringing wealth into those countries than getting more loans from the International Monetary Fund. However in practice these new socialists (even Hugo Chavez, whose oil nationalization was not unprecedented) have not gone much beyond the social democracy prevalent in mid-20th-century [[Europe]]. In the West, socialism in a revolutionary sense has become a symbol of rebellion against the capitalist economic order, with radical chic bohemians and [[hippie]]s who support socialist doctrine as an act of rebelliousness and righteous (sometimes) anger but who still have difficulty envisioning a post-capitalist economy.\n\nPeople who believe in socialism are referred to variously as \"socialists\" or \"[[communist]]s\", the difference being that socialists believe in socialism as an end in itself while communists only believe in it as a \"transitional phase\" leading into the development of a \"communist society\", i.e. a [[Social class|classless]], [[money]]less and [[state]]less form of social organization. This was a distinction originally made by Marx and Engels to distinguish their theories from previous utopian socialist theories.<ref>[http://www.deleonism.org/cgi-bin/text.cgi?j=91092101 \"The Socialist Industrial Union Program of Daniel De Leon\"].</ref> Indeed, Marx and Engels spoke of the \"lower and higher phases of communism\" in the ''Critique of the Gotha Program'', but it was Lenin and the Soviets who reformulated this concept as the stages of \"socialism\" and \"communism\".<ref>Vladimir Lenin. [https://www.marxists.org/archive/lenin/works/1917/staterev/ch05.htm \"The State and Revolution — Chapter 5\"]. Marxists.org.</ref> Lenin also mistranslated the original German in ''State and Revolution'' of the phrase \"it withers away\" about the state as that is not something that Engels ever wrote in relation to the state. What Engels actually wrote is \"Der Staat wird nicht abgeschafft, er stirbt ab\", which literally translates as \"The state is not abolished, it dies [out]\".<ref>Friedrich Engels. [http://www.mlwerke.de/me/me19/me19_210.htm \"Friedrich Engels - Die Entwicklung des Sozialismus von der Utopie zur Wissenschaft - III\"]</ref> As a matter of fact, both Marx and Engels used interchangeable the words \"socialism\" and \"communism\" to describe the classless, moneyless and stateless form of social organization they advocated. In the aforementioned ''Critique of the Gotha Program'', in describing the lower phase Marx states that \"the individual receives from society exactly what he gives to it\" and advocates remuneration in the form of labour vouchers as opposed to money.<ref>Karl Marx. [http://www.marxists.org/archive/marx/works/1875/gotha/index.htm \"Critique of the Gotha Programme\"].</ref><ref>[http://history.hanover.edu/courses/excerpts/111gotha.html \"The Gotha and Erfurt Programs\"].</ref> In the \"lower phase of communism\" (what would be called \"socialism\") the state and money are already abolished after the revolution which instead must abolish capitalism and the private property,<ref group=note>In ''The German Ideology'', Marx describe communism not as \"a state of affairs which is to be established, an ideal to which reality [will] have to adjust itself. We call communism the real movement which abolishes the present state of things. The conditions of this movement result from the premises now in existence [i.e. capitalism]\" (see [https://www.marxists.org/archive/marx/works/1845/german-ideology/ch01a.htm \"Karl Marx. The German Ideology. 1845 - Part I: Feuerbach\"]) and that \"the emancipation of the working classes must be conquered by the working classes themselves\" (see [https://www.marxists.org/history/international/iwma/documents/1864/rules.htm \"The International Workingmen's Association, General Rules, October 1864\"]). Indeed, ''The Communist Manifesto'' proclaimed: \"The theory of Communism may be summed up in one sentence: Abolish all private property\". However, it must be noted that while in capitalism private and personal property are considered to be exactly equivalent, in socialist, Marxist and anarchist philosophies the distinction between private and personal property is extremely important:\n* Personal property includes \"items intended for personal use\" (see [http://www.liberationnews.org/10-09-23-eight-myths-about-socialismand-html \"Eight myths about socialism—and their answers\"]), e.g. clothes, homes, vehicles and sometimes money (see [https://books.google.com/books?id=pjasAAAAIAAJ&printsec=frontcover \"African Socialism\"]. p. 25). It must be gained in a socially fair manner and the owner has a distributive right to exclude others.\n* Private property is a social relationship between the owner and persons deprived (not a relationship between person and thing), e.g. artifacts, factories, mines, dams, infrastructure, natural vegetation, mountains, deserts and seas. Marxism holds that a process of class conflict and revolutionary struggle could result in victory for the proletariat and the establishment of a communist society in which private property and ownership is abolished over time and the means of production and subsistence belong to the community. In this context, private property and ownership means ownership of the means of production, not personal possessions.\n* To many socialists, the term private property refers to capital or the means of production while personal property refers to consumer and non-capital goods and services (see [http://anarchism.pageabode.com/afaq/secB3.html#secb31 \"What is the difference between private property and possession?\"] and [https://www.jacobinmag.com/2016/02/socialism-marxism-private-property-person-lennon-imagine-kenny-loggins/ \"End Private Property, Not Kenny Loggins\"]).\n\nAs stated in ''The Communist Manifesto'': \"The distinguishing feature of Communism is not the abolition of property generally, but the abolition of bourgeois property. But modern bourgeois private property is the final and most complete expression of the system of producing and appropriating products, that is based on class antagonisms, on the exploitation of the many by the few.\n\nIn this sense, the theory of the Communists may be summed up in the single sentence: Abolition of private property\" (see [https://www.marxists.org/archive/marx/works/1848/communist-manifesto/ch02.htm \"Communist Manifesto (Chapter 2)\"]).</ref> but labour vouchers may be used (\"To each according to his contribution\") before reaching the \"higher phase of communism\" in which they are no longer needed and we have what is advocated by anarcho-communists (\"From each according to his ability, to each according to his needs\"). Hence, the \"lower phase of communism\" is more similar to what was called collectivist anarchism (with anarchist Mikhail Bakunin advocating the abolition of class, money and state while using labour vouchers) rather than states who claimed to have achieved socialism.\n\n[[Alternative facts|Alternatively]], in the [[United States]], socialism is widely regarded as \"when the government does stuff\".",
  "fullInfo": {
    "general": {},
    "tables": [],
    "lists": []
  },
  "html": "<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:167px;\"><a href=\"/wiki/File:Madrid_may_day375.jpg\" class=\"image\"><img alt=\"\" src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Madrid_may_day375.jpg/165px-Madrid_may_day375.jpg\" width=\"165\" height=\"96\" class=\"thumbimage\" srcset=\"https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Madrid_may_day375.jpg/248px-Madrid_may_day375.jpg 1.5x, https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Madrid_may_day375.jpg/330px-Madrid_may_day375.jpg 2x\" /></a>  <div class=\"thumbcaption\"><div class=\"magnify\"><a href=\"/wiki/File:Madrid_may_day375.jpg\" class=\"internal\" title=\"Enlarge\"></a></div>May Day in Madrid, 2006.</div></div></div>\n<table class=\"infobox\" cellpadding=\"1\" cellspacing=\"0\" style=\"float: right; margin: 0 0 0.5em 0.5em; text-align:left; border: 1px solid #008b00; width:175px;\">\n<tr>\n<td style=\"font-size: 95%; text-align:center; color:White; background-color:#008b00\"> <b>The dismal science</b><br /><a href=\"/wiki/Economics\" title=\"Economics\"><font size=\"4\" color=\"White\"><b>Economics</b></font></a>\n</td></tr>\n<tr>\n<td style=\"background-color:#f5fffa;\" align=\"center\"><a href=\"/wiki/Category:Economics\" title=\"Category:Economics\"><img alt=\"Icon economics.svg\" src=\"/w/images/thumb/d/d2/Icon_economics.svg/100px-Icon_economics.svg.png\" width=\"100\" height=\"100\" srcset=\"/w/images/thumb/d/d2/Icon_economics.svg/150px-Icon_economics.svg.png 1.5x, /w/images/thumb/d/d2/Icon_economics.svg/200px-Icon_economics.svg.png 2x\" /></a>\n</td></tr>\n\n<tr>\n<td style=\"font-size: 95%; color:White; background-color:#008b00; text-align:center;\"><b>Economic Systems</b>\n</td></tr>\n<tr>\n<td style=\"font-size: 95%; background-color:#f5fffa;\">\n<p>&#160;&#160;$ &#160;<a href=\"/wiki/Capitalism\" title=\"Capitalism\">Market Economy</a><br />\n&#160;&#160;€ &#160;<a href=\"/wiki/Social_Democracy\" title=\"Social Democracy\" class=\"mw-redirect\">Mixed Economy</a><br />\n&#160;&#160;☭&#160;<strong class=\"selflink\">Socialist Economy</strong>\n</p>\n</td></tr>\n<tr>\n<td style=\"font-size: 95%; color:White; background-color:#008b00; text-align:center;\"><b>Major Concepts</b>\n</td></tr>\n<tr>\n<td style=\"font-size: 95%; background-color:#f5fffa;\">\n<ul><li><a href=\"/wiki/Demurrage_currency\" title=\"Demurrage currency\">Demurrage currency</a></li>\n<li><a href=\"/wiki/Energy_crisis\" title=\"Energy crisis\">Energy crisis</a></li>\n<li><a href=\"/wiki/McWorld\" title=\"McWorld\">McWorld</a></li>\n<li><a href=\"/wiki/National_income_accounting\" title=\"National income accounting\">National income accounting</a></li>\n<li><a href=\"/wiki/Wage_ceiling\" title=\"Wage ceiling\">Wage ceiling</a></li></ul>\n</td></tr>\n<tr>\n<td style=\"font-size: 95%; color:White; background-color:#008b00; text-align:center;\"><b>People</b>\n</td></tr>\n<tr>\n<td style=\"font-size: 95%; background-color:#f5fffa;\">\n<ul><li><a href=\"/wiki/Dean_Baker\" title=\"Dean Baker\">Dean Baker</a></li>\n<li><a href=\"/wiki/Edward_M._Miller\" title=\"Edward M. Miller\">Edward M. Miller</a></li>\n<li><a href=\"/wiki/Hans-Hermann_Hoppe\" title=\"Hans-Hermann Hoppe\">Hans-Hermann Hoppe</a></li>\n<li><a href=\"/wiki/Thomas_Sowell\" title=\"Thomas Sowell\">Thomas Sowell</a></li></ul>\n<div class=\"vte plainlinks\" style=\"font-size:smaller; text-align:center;\"><a href=\"/wiki/Template:Economics\" title=\"Template:Economics\">v</a> - <a href=\"/wiki/Template_talk:Economics\" title=\"Template talk:Economics\">t</a> - <a rel=\"nofollow\" class=\"external text\" href=\"https://rationalwiki.org/w/index.php?title=Template:Economics&amp;action=edit\">e</a></div>\n</td></tr></table>\n<p><b>Socialism</b> refers to a set of related <a href=\"/wiki/Sociology\" title=\"Sociology\">socio</a>-<a href=\"/wiki/Economics\" title=\"Economics\">economic</a> systems based on social ownership of the means of production (as opposed to individuals personally owning them) and political management of the economy (where every individual theoretically has a small degree of influence on how large amounts of resources are used) and <a href=\"/wiki/Ideology\" title=\"Ideology\">ideologies</a> that seek to promote <a href=\"/wiki/Equality\" title=\"Equality\">equality</a> of opportunity while maximizing opportunities for \"self-actualization\". The exact forms of socialism differ, with some forms advocating for voluntary cooperative enterprises within a market economy while other forms advocate for a more comprehensive transformation with economic planning replacing capital markets and all means of production being held in common. It is typically opposed to <a href=\"/wiki/Plutocracy\" title=\"Plutocracy\">plutocracy</a> yet often emphasizes in some form or another that people who work and produce the value in society should be rewarded in monetary terms in accordance to their work effort. In the developed world during the Industrial Revolution, workers often felt underpaid for their labour, and dangerous working conditions were commonplace. While this has diminished in the developed world as it has become wealthier, multinational <a href=\"/wiki/Corporation\" title=\"Corporation\">corporations</a> have succeeded in...",
  "sections": []
}
